Revit 2027 API
PanelScheduleSheetInstance.Create Method
 Creates a new instance of panel schedule on sheet and adds it to the document.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PanelScheduleSheetInstance Create(
	Document ADoc,
	ElementId scheduleId,
	View DBView
)
Public Shared Function Create (
	ADoc As Document,
	scheduleId As ElementId,
	DBView As View
) As PanelScheduleSheetInstance
public:
static PanelScheduleSheetInstance^ Create(
	Document^ ADoc,
	ElementId^ scheduleId,
	View^ DBView
)
static member Create :
        ADoc : Document *
        scheduleId : ElementId *
        DBView : View -> PanelScheduleSheetInstance
Parameters
ADoc Document
scheduleId ElementId
DBView View
Return Value
PanelScheduleSheetInstance
 The newly created panel schedule sheet instance element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace